                
                                             //         (类型)         强制类型转换
//#include <stdio.h>
//int main()
//{
//	//int a = (int)3.14;
//	return 0;
//}






                                                //          &&    逻辑与     左边为假右边不执行
                                                //          ||    逻辑或     左边为真右边不执行
//#include <stdio.h>
//int main()
//{
//    int i = 0, a = 0, b = 2, c = 3, d = 4;
//    //i = a++ && ++b && d++;
//    i = a++ || ++b || d++;
//    printf("a=%d b=%d c=%d d=%d", a, b, c, d);
//    return 0;
//}







//                                                         //   逗号表达式      
//                                              //用逗号隔开多个表达式     由左向右依次执行     整个表达式的结果是最后一个表达式的结果
//#include <stdio.h>
//int main()
//{
//    int a = 1;
//    int b = 2;
//    int c = (a > b, a = b + 10, a, b = a + 1);
//    printf("%d", c);
//    return 0;
//}







                                                                   //   '.'    点操作符
                                                                   //                       '.'的左边是结构体“变量”  右边是成员名
                                                                   // 
                                                                   // 
                                                                   // 
//创建了一个结构体类型   名字叫   struct student
//#include <stdio.h>
//struct student                //struct   结构体   相当于一种类型    用于创建变量
//{
//    //成员变量
//    char name[20];
//    int age;
//    char id[20];
//};
//int main()
//{
//    //使用struct student 这个类型创建了一个学生对象s1，并且初始化了
//    struct student s1 = { "张三",18,"20211111" };
//
//    struct student* ps = &s1;                        //使用指针    通过解引用找到s1里的值并赋给      结构体指针  ps
//
//    printf("%s\n", ps->name);
//    printf("%d\n", ps->age);                      //       ->    指针指向        左边是结构体“指针”   右边是成员名
//    printf("%s\n", ps->id);
//
//
//             //printf("%s\n", (*ps).name);                    //解引用ps   通过  .  访问成员
//             //printf("%s\n", (*ps).age);                          
//             //printf("%s\n", (*ps).id);
//
//
//                         //printf("%s\n", s1.name);
//                         //printf("%d\n", s1.age);
//                         //printf("%s\n", s1.id);
//    return 0;
//}




                                                         //    隐式类型转换       整形提升       按照变量的数据类型的符号位来提升的
                                                           //         有符号用符号来提升   无符号全部补0
                                                           //   只要类型小于int都会进行整形 提升
                                                         //     cpu中的运算是以   int  进行运算的
//#include <stdio.h>
//int main()
//{
//    char a = 3;
//    //000000000000000000000000   00000011         原本3是前面一串但是因为是一个char类型，所以截断，从后往前截断1个字节
//    char b = 127;
//    //000000000000000000000000   01111111         
//    
//    //      00000011    以符号位来提升变成         00000000000000000000000000000011 
//    //      01111111    以符号位来提升变成         00000000000000000000000001111111 
//
//    //                                        c =  00000000000000000000000010000010
//    //               但是c是一个char类型，所以需要截断变成                 10000010
//
//
//
//    char c = a + b;
//                                      //  %d   是一个整形    又要进行整形提升变成            111111111111111111111111  10000010   补码
//                                      //                                                     111111111111111111111111  10000001   反码
//                                      //                                                     100000000000000000000000  01111110   原码
//
//    printf("%d", c);              
//    return 0;
//}

