//#include <stdio.h>
//int main()
//{
//	int n = 9;
//	float* pFloat = (float*)&n;                                       //整形和浮点型在内存中的存储是不一样的 
//																	//整形的方式存储就用整形的方式取出    浮点型也一样
//	printf("n的值为：%d\n", n);
//	printf("*pFloat的值为：%f\n", *pFloat);
//
//
//	*pFloat = 9.0;
//	printf("num的值为：%d\n", n);
//	printf("*pFloat的值为：%f\n", *pFloat);
//	return 0;
//}


#include <stdio.h>
int main()
{
	float a=4.5;
	// 4.5的二进制位          100.1
	// 浮点型的存储后变成    （-1）^0   *  1.001   *   2^2
	//  s=0             s  表示符号位
	//  M=1.001         M  表示有效数字   即科学计数法下的前半部分      
	//  E=2             E  表示指数位  
	//根据IEEE 754规定  M  存储时只存储.后边的数   并且存储23个比特位      所以  M=00100000000000000000000
	//                  E  存储时要加上中间值127  所以         E=129=10000001
	//IEEE又规定 第1个比特位存储 s  中间8个比特位存储E  最后23个比特位存储M  
	//所以4.5在内存中存储的二进制是   0  10000001        00100000000000000000000
	//                                s      E                  M
	//         在内存中存储的二进制是           01000000100100000000000000000000
	//               转化为16进制是         0100 0000 1001 0000 0000 0000 0000 0000
	//                                        4   0     9   0    0      0    0   0
	//           16进制是0x  40900000
	return 0;


	//当从内存中取出浮点数时    s不变   E先-127  在放到2的指数位   M+1再与前面相乘
	//当E全为0或者全为1时有特殊的处理方式

}
