                                          //              >>                 <<


//#include <stdio.h>
//int main()
//{
//	int a = -1;
//	int b = a >> 1;                          //       >>   右移操作符   将二进制位向右移动一位.
//	                           //     00000000000000000000000000010000                                负数符号位  1   正数符号位   0
//	                              //    1.  算术右移   ，右边丢弃，左边补符号位          一般编译器都是算数右移
//	                              //    2.逻辑右移   ，右边丢弃，左边补0
//	                              //右移有   /2      的效果
//
//	printf("%d", b);
//	return 0;
//}
//int main()
//{
//	int a = 1;
//	int b = a << 1;                      //      <<   左移操作符    左边丢弃  右边补0      左移有   *2  的效果
//	printf("%d", b);
//	return 0;
//}
                                             //   移位操作符不要移动    负数 (a>>-1)(x)      只能作用于整数








                                //             &           |         ^
//#include <stdio.h>
//int main()
//{
//    ////   &   按二进制位  与
//    //int a = 3;                          //      00000000000000000000000000000011                 补码形式
//    //int b = 5;                          //      00000000000000000000000000000101                全为1才是1   有一个0都是0
//    //int c = a & b;                      //      00000000000000000000000000000001
//    //printf("%d", c);
//
//
//    //    |   按二进制位   或
//    //int a = 3;                                  //      00000000000000000000000000000011    
//    //int b = 5;                                  //      00000000000000000000000000000101       有一个1结果为1
//    //int c = a | b;                              //      00000000000000000000000000000111    
//    //printf("%d", c);
//
//
//    //  ^   按二进制位   异或
//    int a = 3;                               //      00000000000000000000000000000011              
//    int b = 5;                               //      00000000000000000000000000000101            相同为0   相异为1
//    int c = a ^ b;                           //      00000000000000000000000000000110 
//    printf("%d", c);
//    return 0;
//}










                                                   //          交换两个数的值
                                                   // 
                                                   // 
//#include <stdio.h>
//int main()
//{
//    // 1.   创建临时变量
//    /*int a = 3;
//    int b = 5;
//    printf("before  a = %d  b = %d\n", a, b);
//    int tmp = 0;
//    tmp = a;
//    a = b;
//    b = tmp;
//    printf("after   a = %d  b = %d", a, b);*/
//
//
//    //   2.    加减法   缺陷  可能会溢出
//    //int a = 3;
//    //int b = 5;
//    //printf("before  a = %d  b = %d\n", a, b);
//    //a = a + b;
//    //b = a - b;
//    //a = a - b;
//    //printf("after   a = %d  b = %d", a, b);
//
//    //   3.    按位异或     缺点   程序可读性低    效率不高
//    //int a = 3;
//    //int b = 5;
//    //printf("before  a = %d  b = %d\n", a, b);
//    //a = a ^ b;                                     //   3和5异或产生的当成密码    这个密码与3异或产生5    与5异或产生3
//    //b = a ^ b;
//    //a = a ^ b;
//    //printf("after   a = %d  b = %d", a, b);
//    //return 0;
//}











                                               //求一个整数存储在二进制中1的个数
                                               // 
                                               // 
//#include <stdio.h>
//int main()
//{
//    int i,num,count=0;
//    scanf_s("%d", &num);
//    //while (num)
//    //{
//    //    if (num % 2 == 1)          //无法统计负数
//    //    {
//    //        count++;
//    //    }
//    //    num /= 2;
//    //}
//
//
//
//    //for (i = 0; i < 32; i++)         //效率不高，必须循环32次
//    //{
//    //    if ((num >> i & 1) == 1)
//    //    {
//    //        count++;
//    //    }
//    //    //num = num >> 1;
//    //}
//    //printf("%d", count);
//
//
//
//    while (num)                       //  效率最高    每执行一次就少一个1
//    {
//        num = num & (num - 1);
//        count++;
//    }
//    printf("%d", count);
//    return 0;
//}









                                                         //         &    和       *

//#include <stdio.h>
//int main()
//{
//    int a = 10;
//    int* p=&a;                //   &  取地址操作符     int*指针变量
//    *p = 20;                  //   *   解引用操作符   通过地址找到a
//    printf("%d", a);
//    return 0;
//}







                                                   //    sizeof()        计算的是变量所占内存空间的大小    单位是   字节  bit

                                                    //对于变量可以省略括号  但是对于类型不能省

//#include <stdio.h>
//int main()
//{
//    int a = 10;
//    char c = 'r';
//    char* p = &c;
//    int arr[10] = { 0 };
//    printf("%d\n", sizeof(a));    //整形是4个字节
//    printf("%d\n", sizeof(int));
//
//    printf("%d\n", sizeof(c));    //char数组中有一个元素   内存是  1字节
//    printf("%d\n", sizeof(char));
//
//    printf("%d\n", sizeof(p));    //指针大小要么是4要么是8    32位的操作系统是4   64位的是8
//    printf("%d\n", sizeof(char*));
//
//    printf("%d\n", sizeof(arr));  //  数组有10个整形元素   一个元素是4个字节   所以是   4*10=40
//    printf("%d\n", sizeof(int [10]));         //数组去掉数组名剩下的就是   类型
//
//
//
//    short s = 0;
//    int a = 10;
//    printf("%d\n", sizeof(s = 5 + a));        //sizeof()  括号里面的表达式是不参与运算的     不该变s的值
//    printf("%d\n", s);
//    return 0;
//}





                                                 //      ~     按二进制位取反
#include <stdio.h>
int main()
{
    //int a = 0;
    //  printf("%d", ~a);

    //int a = 11;                             //0000000000000000001011        
    //                                        0000000000000000000100             将这两个数按位  或    可得下边
    //a = a | (1 << 2);                       //0000000000000000001111
    //printf("%d\n", a);                        

    //                                        //0000000000000000001111 
    //                                        //0000000000000000000100          按位取反后得到 230行
    //                                        //1111111111111111111011             将这229和231两个数按位 与 可得下边
    a = a & (~(1 << 2));                    //0000000000000000001011 
    printf("%d", a);
    return 0;
}